In [3]:
import pandas as pd

df = pd.DataFrame({
    'country' : ['India', 'US', 'Japan', 'US', 'Japan'],
    'age' : [44,54,21,43,52],
    'salary' : [50000,65000,20000,45000,34000]
})
df

  country  age  salary
0   India   44   50000
1      US   54   65000
2   Japan   21   20000
3      US   43   45000
4   Japan   52   34000

In [4]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   50000
1        2   54   65000
2        1   21   20000
3        2   43   45000
4        1   52   34000

In [5]:
label_encoder.classes_

array(['India', 'Japan', 'US'], dtype=object)

In [7]:
X = df['country'].values.reshape(-1,1)
X

array([[0],
       [2],
       [1],
       [2],
       [1]])

In [10]:
from sklearn.preprocessing import OneHotEncoder

OneHot_Encoder = OneHotEncoder()
X = OneHot_Encoder.fit_transform(X).toarray()
X

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [12]:
OneHot_Encoder.categories_

[array([0, 1, 2])]

In [13]:
df_onehot = pd.DataFrame(X, columns=[str(i) for i in range(X.shape[1])])
df_onehot

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

In [17]:
df = pd.concat([df_onehot, df], axis=1)
df

     0    1    2    0    1    2  country  age  salary
0  1.0  0.0  0.0  1.0  0.0  0.0        0   44   50000
1  0.0  0.0  1.0  0.0  0.0  1.0        2   54   65000
2  0.0  1.0  0.0  0.0  1.0  0.0        1   21   20000
3  0.0  0.0  1.0  0.0  0.0  1.0        2   43   45000
4  0.0  1.0  0.0  0.0  1.0  0.0        1   52   34000

In [18]:
df = df.drop(['country'], axis=1)
df

     0    1    2    0    1    2  age  salary
0  1.0  0.0  0.0  1.0  0.0  0.0   44   50000
1  0.0  0.0  1.0  0.0  0.0  1.0   54   65000
2  0.0  1.0  0.0  0.0  1.0  0.0   21   20000
3  0.0  0.0  1.0  0.0  0.0  1.0   43   45000
4  0.0  1.0  0.0  0.0  1.0  0.0   52   34000